<?php

/**
 * Project ~ iPayNow
 * FileName: iPayNowCode.php
 *
 * @author:  Laoliu <laoliu@lanmv.com>
 *
 * Date: 16/10/18 下午3:06
 */
class iPayNowCode
{
    // 请求应答码
    static public $RespondCode
        = [
            "A001" => "成功",
            "A002" => "失败",
            "A101" => "户名错误",
            "A102" => "账号错误",
            "A103" => "银行交易状态未知",
            "A104" => "账号余额不足",
            "A105" => "银行交互失败",
            "A106" => "身份验证不通过",
            "A107" => "帐号类型不合法",
            "A108" => "超出交易限额",
            "A109" => "金额异常",
            "A110" => "原交易流水不存在",
            "A111" => "账户不允许交易",
            "A112" => "证件号码非法，请核实",
            "A113" => "银行不支持该笔交易",
            "A114" => "持卡人身份信息或手机号输入不正确，验证失败",
            "A115" => "账号信息重复，请确认",
            "A116" => "未进行实名认证或认证不通过",
            "A117" => "超出单日限额",
            "A118" => "超出单月限额",
            "A119" => "帐号户名不符",
            "A120" => "无可用渠道",
            "A121" => "交易超时",
            "A122" => "收款行行号错误",
            "A123" => "账户类型不支持",
            "A124" => "收款行处理失败",
            "A125" => "超出授信额度",
            "A126" => "非交易时间窗口",
            "A127" => "对公户扣款失败",
            "A128" => "账户未在银行端签约",
            "A129" => "当天累计交易金额超出阀值(证券类客户)",
            "A130" => "当天累计交易笔数超出阀值(证券类客户)",
            "A131" => "虚拟户扣款失败",
            "A132" => "请求地址验证不通过",
            "A133" => "渠道不可用",
            "A134" => "银行交易维护中",
            "A135" => "银行渠道异常，将进行差错退款",
            "A136" => "对账差错退款",
            "A137" => "业务操作异常",
            "A138" => "银行交互超时",
            "A139" => "不支持的操作",
            "A140" => "渠道请求重复",
            "A141" => "白名单采集失败",
            "A142" => "白名单认证结果未知",
            "A143" => "验证码无效",
            "A144" => "验证码失效",
            "A145" => "交易不合法",
            "A146" => "代收金额与之前不符",
            "A147" => "手机号本日发送次数超出上限",
            "A148" => "卡信息未采集成功",
            "A149" => "重复交易",
            "A150" => "白名单采集异常",
            "A151" => "不支持该行银行卡",
            "A152" => "暂时不支持贷记卡",
            "A153" => "验证码尝试次数超出上限",
            "A154" => "获取账户信息失败",
            "A155" => "风险控制失败",
            "A156" => "冻结金额失败",
            "A157" => "请求超时",
            "A158" => "订单初始化失败",
            "A159" => "查询交易不存在",
            "A160" => "交易请求重复",
            "A161" => "交易类型不符",
            "A162" => "账户余额不正确",
            "A163" => "交易金额不正确",
            "A164" => "账户余额不足",
            "A165" => "原交易不存在",
            "A166" => "冻结金额出款超限",
            "A167" => "冻结金额与交易金额不匹配",
            "A168" => "对应银行不存在",
            "A169" => "账户不存在",
            "A170" => "账户状态不正确",
            "A171" => "账户冻结",
            "A172" => "账户已授权",
            "A173" => "开金融户余额户未开",
            "A174" => "可用余额不足",
            "A175" => "冻结余额不足",
            "A176" => "可用余额调整失败",
            "A177" => "超过24小时交易关闭",
            "A178" => "订单不为初始化不允许发送验证码",
            "A179" => "发送验证码失败",
            "A180" => "收款行行号未提供",
            "A181" => "银行通信失败",
            "A182" => "原代收交易不成功",
            "A183" => "重复退款",
            "A184" => "商户订单号重复",
            "A185" => "四要素不一致",
            "A186" => "不支持信用卡",
            "A202" => "交易失败",
            "A205" => "账户余额不足",
            "A206" => "分账规则不正确",
            "A301" => "交易时间不符",
            "A302" => "数据类型错误",
            "A303" => "参数错误",
            "A304" => "验签失败",
            "A305" => "IP非法",
            "A307" => "获取商户密钥失败",
            "A308" => "请求信息解密失败",
            "A315" => "查询交易不存在",
            "A399" => "其它错误",
            "A400" => "处理中"
        ];

    // 交易状态码
    static public $TransactionCode
        = [
            "00" => "成功",
            "01" => "失败",
            "02" => "处理中",
            "03" => "初始状态"
        ];

    // 代付退票信息字段
    static public $PaidRefundCode
        = [
            "nowPayOrderNo"         => "现在支付退票流水号",
            "originalNowPayOrderNo" => "原现在支付代付流水号",
            "tradeStatus"           => "退票状态",
            "refundCode"            => "退票码",
            "refundMsg"             => "退票原因",
            "refundDate"            => "退票日期",
            "payeeCardNo"           => "原代付收款人卡号",
            "payeeName"             => "原代付收款人姓名",
            "payeeAccType"          => "原代付类型",
            "payeeCardUnionNo"      => "原代付收款行联名号"
        ];
}